---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.SwitchFromLegendBeforeCreateSimilar
source: html/c0b61057-ec94-f045-6bc2-30d3f2e2ba68.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.SwitchFromLegendBeforeCreateSimilar Property

To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.

## Syntax (C#)
```csharp
public static FailureDefinitionId SwitchFromLegendBeforeCreateSimilar { get; }
```